# ************************************************************
# Sequel Pro SQL dump
# Версия 4541
#
# http://www.sequelpro.com/
# https://github.com/sequelpro/sequelpro
#
# Адрес: 127.0.0.1 (MySQL 5.5.5-10.3.32-MariaDB-1:10.3.32+maria~focal)
# Схема: burlang
# Время создания: 2021-11-24 22:38:46 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# Дамп таблицы auth_assignment
# ------------------------------------------------------------

DROP TABLE IF EXISTS `auth_assignment`;

CREATE TABLE `auth_assignment` (
  `item_name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `user_id` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` int(11) DEFAULT NULL,
  PRIMARY KEY (`item_name`,`user_id`),
  CONSTRAINT `auth_assignment_ibfk_1` FOREIGN KEY (`item_name`) REFERENCES `auth_item` (`name`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `auth_assignment` WRITE;
/*!40000 ALTER TABLE `auth_assignment` DISABLE KEYS */;

INSERT INTO `auth_assignment` (`item_name`, `user_id`, `created_at`)
VALUES
	('admin','1',1470793945),
	('admin','2',1477062284);

/*!40000 ALTER TABLE `auth_assignment` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы auth_item
# ------------------------------------------------------------

DROP TABLE IF EXISTS `auth_item`;

CREATE TABLE `auth_item` (
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `type` int(11) NOT NULL,
  `description` text COLLATE utf8_unicode_ci DEFAULT NULL,
  `rule_name` varchar(64) COLLATE utf8_unicode_ci DEFAULT NULL,
  `data` text COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL,
  `updated_at` int(11) DEFAULT NULL,
  PRIMARY KEY (`name`),
  KEY `rule_name` (`rule_name`),
  KEY `idx-auth_item-type` (`type`),
  CONSTRAINT `auth_item_ibfk_1` FOREIGN KEY (`rule_name`) REFERENCES `auth_rule` (`name`) ON DELETE SET NULL ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `auth_item` WRITE;
/*!40000 ALTER TABLE `auth_item` DISABLE KEYS */;

INSERT INTO `auth_item` (`name`, `type`, `description`, `rule_name`, `data`, `created_at`, `updated_at`)
VALUES
	('admin',1,'Administrator',NULL,NULL,1470793926,1470793926),
	('adminBook',2,'Administrate book',NULL,NULL,1470793926,1470793926),
	('adminNews',2,'Administrate news',NULL,NULL,1470793926,1470793926),
	('moderator',1,'Moderator',NULL,NULL,1470793926,1470793926);

/*!40000 ALTER TABLE `auth_item` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы auth_item_child
# ------------------------------------------------------------

DROP TABLE IF EXISTS `auth_item_child`;

CREATE TABLE `auth_item_child` (
  `parent` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `child` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`parent`,`child`),
  KEY `child` (`child`),
  CONSTRAINT `auth_item_child_ibfk_1` FOREIGN KEY (`parent`) REFERENCES `auth_item` (`name`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `auth_item_child_ibfk_2` FOREIGN KEY (`child`) REFERENCES `auth_item` (`name`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `auth_item_child` WRITE;
/*!40000 ALTER TABLE `auth_item_child` DISABLE KEYS */;

INSERT INTO `auth_item_child` (`parent`, `child`)
VALUES
	('admin','adminNews'),
	('admin','moderator'),
	('moderator','adminBook');

/*!40000 ALTER TABLE `auth_item_child` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы auth_rule
# ------------------------------------------------------------

DROP TABLE IF EXISTS `auth_rule`;

CREATE TABLE `auth_rule` (
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `data` text COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL,
  `updated_at` int(11) DEFAULT NULL,
  PRIMARY KEY (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;



# Дамп таблицы book
# ------------------------------------------------------------

DROP TABLE IF EXISTS `book`;

CREATE TABLE `book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `content` text DEFAULT NULL,
  `active` tinyint(1) NOT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `slug` (`slug`),
  UNIQUE KEY `idx-book-title` (`title`),
  KEY `fk-book-created_by-user-id` (`created_by`),
  KEY `fk-book-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-book-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-book-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;

INSERT INTO `book` (`id`, `title`, `slug`, `description`, `content`, `active`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'Учебник бурятского языка','ucebnik-buratskogo-azyka','На данный момент, мы занимаемся версткой книги.','На данный момент, мы занимаемся версткой книги.',1,1,1,1466107143,1467693584);

/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы book_chapter
# ------------------------------------------------------------

DROP TABLE IF EXISTS `book_chapter`;

CREATE TABLE `book_chapter` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `content` text DEFAULT NULL,
  `book_id` int(11) NOT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `book_chapter-book_id-book-id` (`book_id`),
  KEY `fk-book_chapter-created_by-user-id` (`created_by`),
  KEY `fk-book_chapter-updated_by-user-id` (`updated_by`),
  CONSTRAINT `book_chapter-book_id-book-id` FOREIGN KEY (`book_id`) REFERENCES `book` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-book_chapter-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-book_chapter-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `book_chapter` WRITE;
/*!40000 ALTER TABLE `book_chapter` DISABLE KEYS */;

INSERT INTO `book_chapter` (`id`, `title`, `slug`, `content`, `book_id`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'Введение','vvedenie','1. История бурятского языка\r\n2. Алфавит\r\n3. Характеристика звуков\r\n4. Согласный Н\r\n5. Йотированные гласные\r\n6. Гласные\r\n7. Краткие гласные\r\n8. Долгие гласные\r\n9. Дифтонги\r\n10. Таблица гласных\r\n11. Сингармонизм\r\n12. Слог\r\n13. Ударение\r\n14. Морфологический строй\r\n15. Словообразование\r\n16. Основа слова\r\n17. Суффикс\r\n18. Части речи\r\n19. Склонения\r\n\r\n##1. Краткая история создания бурятского литературного языка и его письменности\r\n---\r\nК моменту Великой Октябрьской социалистической революции бурятский народ пользовался старомонгольской письменностью. На этой письменности имеется изрядное количество литературы в виде историко-летописных документов, например: летописи селенгинских, хоринских, баргузинских и других бурят, а также - памятники бурятского права.\r\n\r\nСтаромонгольский алфавит и его письменный язык, которыми пользовался бурятский народ, не могли в полной мере обеспечить развитие национального языка бурятского народа. Одним из главных недостатков этой письменности являлось то, что она в фонетическом отношении не отражала звуковую систему разговорного бурятского языка.\r\n\r\nВ 1936 году на лингвистической конференции в Улан-Удэ было принято решение, что в основу бурятского литературного языка должен быть положен хоринский диалект.\r\n\r\nУстановление литературного языка на основе хоринского диалекта оправдало себя исторически и создало основу для последующего успешного развития бурятского языка.\r\n\r\nВместе с тем следует отметить, что формированию литературного бурятского языка содействовал его переход сначала на латинскую, а позже, в 1939 г. на русскую графику.\r\n\r\nБурятский алфавит, основанный на русской графике, вполне отражает фонематический состав бурятского языка, что способствует успешному усвоению родного языка в школе и в значительной мере помогает бурятам усваивать русский язык.\r\n\r\n##2. Алфавит\r\n---\r\nАлфавит бурятского литературного языка построен на графической основе русского языка и состоит из 36 букв.\r\n\r\nВсе буквы алфавита имеют свои названия и передают те же звуки, что и соответствующие им в русском алфавите, т.е. одни и те же звуки, имеющиеся в бурятском и русском языках, обозначаются в обоих языках одинаковыми буквами. Для обозначения специфических звуков бурятского языка в алфавит введены три дополнительные буквы: _**ү, өө, һ**_ которые не имеют соответствий в русском алфавите\r\n\r\nАлфавит бурятского языка:\r\n> **\"Аа\"** - а, **\"Бб\"** - бэ, **\"Вв\"** - вэ, **\"Гг\"** - гэ, **\"Дд\"** - дэ, **\"Ее\"** - е, **\"Ёё\"** - ё,  \r\n> **\"Жж\"** - жэ, **\"Зз\"** - зэ, **\"Ии\"** - и, **\"Йй\"** - богони и, **\"Кк\"** - ка, **\"Лл\"** - лэ,  **\"Мм\"** - мэ,  \r\n> **\"Нн\"** - нэ, **\"Оо\"** - о, **\"Өө өө\"** - өө, **\"Пп\"** - пэ,  **\"Рр\"** - рэ,  **\"Cc\"** - сэ,  **\"Тт\"** - тэ,  \r\n> **\"Уу\"** - у, **\"Үү\"** - ү,	**\"Фф\"** - фэ,	**\"Хх\"** - ха,	**\"Һһ\"** - һа,	**\"Цц\"** - цэ, **\"Чч\"** - чэ,  \r\n> **\"Шш\"** - ша, **\"Щщ\"** - ща, **\"ъ\"** - хатуу тэмдэг, **\"ы\"** - ы,	**\"ь\"** - зөөлэн тэмдэг,	**\"Ээ\"** - э,	**\"Юю\"** - ю,	**\"Яя\"** - я\r\n\r\nИз 36 букв алфавита:\r\n\r\n* 12 являются гласными: ***а, о, у, я, е, ё, э, өө, ү, и, ы, ю***\r\n* полугласная - ***й***\r\n* 21 буква является согласной; ***б, в, г, д, ж, к, л, м, н, п, р, с, т, ф, х, һ, ц, ч, ш, щ***;\r\n* а две буквы ***ь, ъ*** никаких звуков не обозначают и выполняют в бурятском такие же функции, как и в русском языке.\r\n\r\nБуквы ***в, к, ф, ц, ч, ш, щ, ъ (твердый знак)*** употребляются только в заимствованных словах из русского языка.\r\n\r\n> пример:  \r\n> **вагон, валенки, варени, кадр, канал, капитал, касса, кино, фабрика, фермэ, футбол цирк, цемент, час, чемодан, щётко, съезд** и т.п.\r\n\r\nкроме того, буквы ***ц*** и ***ч*** встречаются и в бурятских собственных именах тибетского происхождения\r\n\r\n> пример:  \r\n> ***Цэдэн, Чимит*** и т.п.\r\n\r\nОстальные согласные буквы передают звуки, встречающиеся как в коренных бурятских словах, так и в словах, усвоенных из русского языка.\r\n\r\nСлова, усвоенные из русского языка, за исключением тех, которые были заимствованы еще задолго до революции,\r\n\r\n> пример:  \r\n> ***һолоом*** (солома); ***орооһон*** (рожь); ***пеэшэн*** (печь); ***пулаад*** (платок) и т.д.\r\n\r\nпишутся по правилам русской орфографии и усваиваются согласно русскому произношению\r\n\r\n> пример:  \r\n> ***трактор, колхоз, помидор, тракторист, сакманщик*** и т.д.\r\n\r\n##3. Характеристика некоторых специфических звуков бурятского языка, обозначенных в буквах һ, ү, өө\r\n---\r\n**h** — фарингальный щелевой твердый звук, который образуется между корнем языка и задней стенкой зева.\r\n\r\nВ начале слова данный звук произносится глухо, т.е. без участия голоса\r\n\r\n> например:  \r\n> **һайн** (хороший), **һалхин** (ветер), **һанаан** (мысль, дума, намерение) и т.д.\r\n\r\nа в середине слова произносится звонко, с участием голоса\r\n\r\n> например:  \r\n> **бордоһон** (вьюга, буран, снежная метель); **бааһан** (помет); **уһан** (вода) и т.д.\r\n\r\nЗвонкий оттенок ***h*** произносится почти как украинское ***г*** в словах: ***гопак, горилка, гроши*** и т.п.\r\n\r\n**Ү** — узкий огубленный краткий гласный переднего ряда, который произносится при более высоком подъеме языка: кончик языка отходит от резцов назад, а корень языка, наоборот, придвигается вперед\r\n\r\n> например:  \r\n> **хүбүүн** (мальчик); **үгсуүр** (подъем); **хүзүүн** (шея); **үнэн** (правда); **үзэг** (буква); **нүхэн** (отверстие, дыра, щель, нора, берлога); **нүүлэ** (валежник); **түлеэн** (дрова) и т.п.  \r\n\r\nДанному звуку очень близок по своему произношению русский звук, графически обозначенный буквой *** у***\r\n\r\n> например:\r\n> ***пуля, улица, курица, луна, труд*** и т.п.\r\n\r\n**Өө** — широкий огубленный всегда долгий гласный (монофтонг) переднего ряда, при произношении его губы округлены, но более широко, чем при ***ү*** и ***үү***, а язык несколько оттянут назад, слегка приподнят к границе твердого и мягкого неба',1,1,1,1466107513,1473223911),
	(2,'Уроки 1 - 4','uroki-1-4','##Фонетика, правила чтения и правописания\r\n---\r\n###Нэгэдэхи хэшээл. Первый урок\r\n\r\n> Специфические звуки алфавита, обозначенные в буквах _**һ, ү, өө, н (нг)**_\r\n\r\n####**Упражнение № 1. Чтение буквы _һ_**\r\n\r\nһаалишан, һаалта, һаба, модон һаба, һабар, һаднаг, һайндэр, һам, һамбай, һамган, һандали, һиихэ, һолонго, һонгино, һонюуша, һунгалта, һунгалга, һургуули, һургаал, һуури, һүзэг, һуни, һүн, һүлэр, һүүдэр, һэшхэл\r\n\r\n> **Слова:**  \r\n> һаалишан – доярка  \r\n> һаалта – препятствие  \r\n> һаба – жбан, посуда  \r\n> модон һаба – деревянная посуда  \r\n> һабар – лапа  \r\n> һаднаг – кол, столбик, жердь  \r\n> һүн – молоко   \r\n> һүлэр – рассеянный   \r\n> һүүдэр – тень   \r\n> һэшхэл – совесть   \r\n> һиихэ – серьги   \r\n> һонюуша – любопытный   \r\n> һолонго – хорек; радуга   \r\n> һунгалта – выборы   \r\n> һунгалга – избрание   \r\n> һургуули – школа   \r\n> һургаал – наставление  \r\n> һуури – место  \r\n> һүзэг – вера, суеверие  \r\n> һуни – ночь  \r\n> һайндэр – праздник  \r\n> һам – гребень, расческа  \r\n> һамбай – челка  \r\n> һамган – жена, женщина, женский  \r\n> һандали – сиденье, скамейка  \r\n> һонгино – лук  \r\n\r\n####**Упражнение № 2. Чтение буквы _ү_**\r\n\r\nҮнеэн, хүбүун, үбгэн, нүхэр, үдэр, үхибүүн, үгэ, гүрөөһэн, хүбшэ, үндэр, түхэреэн, түрэл, хүзүүн, түүхэ, түгсүүл, үлэн, үүлэн, үүдэн, үбэл\r\n\r\n> **Слова:**  \r\n> үнеэн – корова хүбүүн – мальчик  \r\n> үбгэн – старик  \r\n> нүхэр – друг, товарищ  \r\n> удэр – день  \r\n> үхибүүн – ребенок  \r\n> үгэ – слово  \r\n> гүрөөһэн – косуля  \r\n> хүбшэ – горный хребет; тайга  \r\n> үбэл – зима  \r\n> үндэр – высокий  \r\n> түхэреэн – круглый  \r\n> түрэл – родня, родной  \r\n> хузүүн – шея  \r\n> түүхэ – история  \r\n> түгсуүл – пень  \r\n> үлэн – голодный  \r\n> үүлэн – облако  \r\n> үүдэн – дверь  \r\n\r\n####**Упражнение № 3. Чтение буквы _ӨӨ_**\r\n\r\n> Грамматика:\r\n> Долгий двузначный өө не имеет себе в орфографии литературного бурятского языка краткой пары.\r\n\r\nҮймөөн, зүйдөөл, өөдэгүй, өөдэрхүү, өөрынхин, өөхэн, өөхэгүй.\r\n\r\n> **Слова:**  \r\n> үймөөн – паника, смятение  \r\n> өөдэгуй – негодный, никчемный  \r\n> өөрынхин – свои  \r\n> өөхэгүй – без жира  \r\n> зүйдөөл – сшитый из кусков  \r\n> өөдэрхүү – заносчивый  \r\n> өөхэн – сало  \r\n\r\n####**Упражнение №4**\r\n\r\nВспомните слова на букву _**\"өө\"**_\r\n\r\n####**Упражнение № 5. Чтение переднеязычного _н_**\r\n\r\nШан(г)га һалхин. Хон(г)хо дуугарна. Шубуунай үдэн(г). Манай эндэ нарһан(г), уляаһан(г) ургадаг. Ой соо томо ба жэжэшье ан(г)гууд бии. Булган(г) зэрлиг амитан. Энэ жэл алирһан(г), мойһон(г) элбэг.\r\n\r\n> **Слова:**  \r\n> шанга – сильный  \r\n> һалхин – ветер  \r\n> хонхо – звонок  \r\n> дуугарха – звенит  \r\n> шубуун – птица  \r\n> үдэн – перо  \r\n> манай – наш  \r\n> эндэ – тут, здесь  \r\n> нарһан – сосна  \r\n> уляаһан – осина  \r\n> ургадаг – растет  \r\n> мойһон – черемуха  \r\n> ой – лес  \r\n> соо – в  \r\n> томо – большой  \r\n> жэжэ –мелкий, маленький  \r\n> ан – зверь  \r\n> булган – соболь  \r\n> зэрлиг – дикий  \r\n> амитан – животное  \r\n> жэл – год  \r\n> энэ – это  \r\n> алирһан – брусника  \r\n> элбэг – много,изобилие.  \r\n\r\n**Задание:** Повторить пройденный урок дома.\r\n\r\n###Хоёрдохи хэшээл. Второй урок\r\n\r\n> Йотированные гласные\r\n\r\n####**Упражнение №1. На йотированные _я, е, ю, ё_**\r\n\r\n1) на _**я**_:   \r\nУрда нэгэн сагта, уужам нэгэ нютагта ядагархан яһан эбэртэй, шодогорхон шодон һүүлтэй бабана тэхэ эшэгэн ябадаг байгаа һэн ха. Эхэ оромнай байгаалиин баялигаар ямар баян гээшэб!\r\n\r\n> **Слова:**  \r\n> урда нэгэн сагта – однажды  \r\n> нютаг – родное место, родина  \r\n> баян – богатый  \r\n> шодогорхон\r\n> шодон һүүл – хвост трубой  \r\n> бабана тэхэ  \r\n> эшэгэн – козленок Бабана  \r\n> эхэ орон – родина  \r\n> байгаали – природа  \r\n> баялиг – богатство  \r\n> уужам – широкий, обширный  \r\n> эбэр – рога, рог  \r\n> ямар – какой, что за…  \r\n> ядагархан – загнутый назад  \r\n> яһан –кость  \r\n\r\n2) на _**е**_:  \r\nМинин хүгшэн эжы ерэн наһатай болобо. Уһан үерлэбэ. Энэ уедэ уһанда орожо болохогүй. Үер болоходо аюултай.\r\n\r\n> **Слова:**  \r\n> хугшэн эжы – бабушка  \r\n> үе – период  \r\n> наһан – возраст, годы  \r\n> уһан – вода  \r\n> ерэн – девяносто  \r\n> үер – половодье, разлив реки  \r\n> аюултай – опасный, страшный  \r\n> үерлэхэ – наводнять, затоплять  \r\n\r\n3) на _**ю**_:  \r\nМанай нютагта ехэ нуур бии. Хоёр, юһэ, арбан найма. Үхибүүд нэгэ юумэн тухай шэбэнэн хөөрэлдэнэ. Шэхээрээ дуулаһан – худал, нюдөөрөө үзэһэн – үнэн (оньһон үгэ).\r\n\r\n> **Слова:**  \r\n> нуур – озеро  \r\n> юһэ – девять  \r\n> хоёр – два  \r\n> нэгэ юумэн тухай – о чем-то  \r\n> шэбэнэн – шепотом  \r\n> нюдэн – глаза  \r\n> арбан найма – восемнадцать  \r\n> үхибүуд – дети  \r\n> хөөрэлдэнэ – разговаривют  \r\n> шэхэн – ухо  \r\n> дуулаха – слышать  \r\n> худал – ложь  \r\n> үнэн – правда  \r\n\r\n4) на _**ё**_:  \r\nҮндэр гоё гэрнүүд баригдана. Эжы намда дулаан бээлэй оёно. Ёһо заншалта һайндэрнүүд. Ёһотой хүн.  \r\n\r\n> **Слова:**  \r\n> гэр – дом  \r\n> гоё – красивый  \r\n> баригдана – строится  \r\n> үндэр – высокий  \r\n> намда – мне  \r\n> бээлэй – варежка  \r\n> ёһо заншалта – традиционный  \r\n> һайндэр – праздник  \r\n> ёһотой – настоящий  \r\n> хүн – человек  \r\n> дулаан – теплый  \r\n> оёно – шьет  \r\n\r\n####**Упражнение № 2. На йотированные _яа, ёо, еэ, юу_**\r\n\r\n1) на _**яа**_:  \r\nТахяагай дальбараа газаагуур ябана. Манай колхозой таряан һайнаар ургана. Энэ жэл һархяаг олон.  \r\n\r\n> **Слова:**  \r\n> тахяа – курица  \r\n> дальбараа – птенец  \r\n> һархяаг – гриб  \r\n> олон – много  \r\n> газаагуур – во дворе, на улице  \r\n> ургаха – растет  \r\n> жэл – год  \r\n> таряан – урожай  \r\n> һайнаар – хорошо  \r\n\r\n2)на _**ёо**_:  \r\nЁотогор хүн. Ёлко гоёхо. Аба морёо уһанда оруулба. Орёо мэдүүлэл.  \r\n\r\n> **Слова:**  \r\n> ёотогор – одноглазый, вредный  \r\n> гоёохо – украшать  \r\n> орёо – сложный  \r\n> мэдүүлэл – предложение  \r\n\r\n3)на _**еэ**_:  \r\nЭжы үнеэгээ эдеэлүүлбэ. Үхибүүд һургуулидаа түлеэ хюрөөдэбэ. Эжы һүеэ хөөрүүлээд, хүбүүдтээ уулгаба. Һүхөөр түлеэ хахалдаг. \"А\" үзэг эрдэмэй дээжэ, аяга сай эдеэнэй дээжэ.  \r\n\r\n> **Слова:**  \r\n> үнеэн – корова  \r\n> үхибүүд – дети  \r\n> түлеэн – дрова  \r\n> һүхэ – топор  \r\n> үзэг – буква  \r\n> эрдэм – наука  \r\n> аяга – чашка  \r\n> эдеэн – пища  \r\n> эдеэлүүлхэ – кормить  \r\n> һургуули – школа  \r\n> хюрөөдэхэ – пилить  \r\n> хахалха – колоть  \r\n> дээжэ – лучшая часть, лучший кусок  \r\n> сай – чай  \r\n\r\n4) на _**юу**_:  \r\nҺургуулиин газаа хүүгэд хүхюунээр наадана. Намайе танюулба. Би хүбүүнэйнгээ бэшэгтэ харюу бэшэнэб.  \r\n\r\n> **Слова:**  \r\n> хүхюун – веселый   \r\n> газаа – во дворе  \r\n> бэшэг – письмо  \r\n> харюу – ответ  \r\n> танюулха – давать распознать, знакомить  \r\n> наадаха – играть  \r\n> намайе – меня  \r\n> хүбүүн – сын  \r\n> бэшэхэ – писать  \r\n\r\n> **Грамматика:**  \r\n> Долгие гласные: _**аа, оо, ээ, уу**_ после мягких согласных пишутся в виде: _**яа, ёо, еэ, юу**_\r\n\r\nНамарай эхин  \r\n\r\nНамар хүрэжэ ерэбэ. Үбһэ ногоон, сэсэгүүд хагдарба. Хуһад шарлаба, уляаһад улайба. Модоной набшаһад унана. Үдэр богони болоно. Наранай шараса һуларна. Тиигэбэшье яһала дулаан байна.\r\nОгородой эдеэн, талха таряан эдеэшэнхэй. Хүн зоной ажал хүдэлмэри түлэг дундаа ябажа байна. Поли дээгүур трактор, комбайнууд баян ургаса хуряана.\r\n\r\n> **Слова:**  \r\n> эхин – начало  \r\n> уляаһан – осина  \r\n> шараса – луч, тепло, теплынь  \r\n> улайха – краснеть  \r\n> ногоон – трава  \r\n> эдеэн – еда  \r\n> баян – богатый  \r\n> хуһан – береза  \r\n> сэсэг – цветок  \r\n> дулаан – теплый  \r\n> набшаһан – лист  \r\n> үбһэн – сено  \r\n> ургаса – урожай  \r\n> хуряаха – убирать  \r\n\r\n**Задание 1:**  \r\nа) Выпишите из текста слова с йотироваными гласными  \r\nб) Прочитать, перевести и пересказать текст.  \r\n\r\n**Задание 2:**  \r\nВместо точек поставьте нужные йотированные гласные — краткие или долгие. Перевести слова и составить с данными словами предложения.  \r\nАб…н, д…легат, зох…лшон, ү…р, м…нган, и…нь, …һан, түл…н, ба…н, эд…н, хар…, үн…н, түл…н, тар…н.  \r\n\r\n###Гурбадахи хэшээл. Третий урок  \r\n> Краткие и долгие гласные  \r\n\r\n> **Грамматика:**  \r\n> В бурятском языке гласные делятся на краткие и долгие. Долгота и краткость звуков используются в целях смыслоразличения слов, что и делает их особыми фонемами в данном языке.\r\n\r\n####**Упражнение № 1. На краткие гласные первых слогов**\r\n\r\nһүн – һан: Үхэрэй һүн. Һан һууха.  \r\nхүн – хун: Бэрхэ хүн. Хүн шубуун.  \r\nгэр – гар: Шэнэ гэр. Гар барилсаха.  \r\nүдэр – удар: Һайн үдэр. Удара татаад хаяха.  \r\nһууха – һааха: Хажуудань һууха. Үнеэгээ һааха.  \r\nбүхэ – баха: Бүхэ хүн. Нуурай баха.  \r\nзон – зун: Олон зон. Зун ерэбэ.  \r\n\r\n> **Слова:**  \r\n> һүн – молоко  \r\n> һайн – хороший  \r\n> һан – усилит. частица при глагол.  \r\n> һан һууха – попадать впросак  \r\n> бэрхэ – очень хороший  \r\n> гэр – дом   \r\n> гар – рука  \r\n> хаяха – бросать  \r\n> һууха – сидеть  \r\n> хажуудань – рядом  \r\n> бухэ – сильный  \r\n> зун – лето  \r\n> зон – люди  \r\n> үхэр – корова  \r\n> удара татаха – пороть, распарывать  \r\n> хүн – человек  \r\n> хун шубуун – лебедь  \r\n> шэнэ – новый  \r\n> уда – част. усилит. при глагол. часто соответ. приставке раз–, рас–, от–  \r\n> һааха – доить  \r\n> баха – лягушка  \r\n> олон – много  \r\n> ерэхэ – приходить  \r\n\r\n> **Грамматика:**  \r\n> Краткие гласные первых слогов слова произносятся ясно, отчетливо и обнаруживают в своем употреблении большую устойчивость. Они выступают как фонемы, служащие целям смыслеразличения слова. А краткие гласные непервых слогов произносятся очень бегло, не имеют четкой артикуляции, потому не несут на себе смыслоразличительной функции.\r\n\r\n####**Упражнение № 2. На краткий _а_ и долгий _аа_**\r\n\r\nдаха – дааха: Даха үмдэбэ. Үүргэ дааха.  \r\nтаба – тааба: Таба наһатай. Таабари тааба.  \r\nшаха – шааха: Гахайе шаха. Хадааһа шааха.  \r\nхатаба – хатааба: Модон хатаба. Намаг хатааба.  \r\nзан – заан: Абари зан. Томо заан.  \r\nбара – бараа: Бара барбагар. Бараа абаха.  \r\nдара – даараа: Дара далбагар. Үхибүүд даараа.  \r\n\r\n> **Слова:**  \r\n> даха – доха, зимний тулуп  \r\n> үүргэ – роль  \r\n> таба – пять  \r\n> таабари – загадка  \r\n> шахаха – откармливать (на убой)  \r\n> шааха – вбивать, вколачивать  \r\n> хатаха – высыхать  \r\n> хатааха – сушить  \r\n> зан – нрав, характер  \r\n> абари зан – поведение, нрав  \r\n> бара – усил. частица очень  \r\n> бараа – мебель, имущество  \r\n> дара – усилит. част. очень  \r\n> үхибүүн – ребенок  \r\n> үмдэхэ – одевать  \r\n> дааха – выполнять что-либо  \r\n> наһан – лета, возраст   \r\n> тааха – отгадывать  \r\n> гахай – свинья  \r\n> хадааһан – гвоздь  \r\n> модон – дерево  \r\n> намаг – болото  \r\n> томо – большой  \r\n> заан – слон  \r\n> барбагар – лохматый  \r\n> абаха – покупать, брать  \r\n> далбагар – широкий  \r\n> даараха – мерзнуть, зябнуть  \r\n\r\n####**Упражнение № 3. На краткий _о_ и долгий _оо_**\r\n\r\nдоро – дороо: Доро байна. Тэрэ дороо.  \r\nоно – оноо: Нэгэл онотой ёһотой. Годлиин оноо.  \r\nбожо – боожо: Божо амитан. Боожын ташуур.  \r\nбодол – боодол: Һанал бодол. Аргамжын боодол.  \r\nболгохо – боолгохо: Үндэгэ болгохо. Гараа боолгохо.  \r\n\r\n> **Слова:**  \r\n> доро – внизу  \r\n> дороо – мгновенно, сразу  \r\n> тэрэ дороо – немедленно, тут же  \r\n> аргамжа – веревка (из кожи)  \r\n> һанал – мнение  \r\n> болгохо – варить  \r\n> боохо – заворачивать, бинтовать  \r\n> божо (жэжэ) – маленький  \r\n> боожо – вожжи  \r\n> боожын ташуур – кнут с длинной рукояткой  \r\n> нэгэл онотой ёһотой – должен же быть какой-то способ  \r\n> оноо – зарубки (на стреле), разрез  \r\n> оно – способ  \r\n> годли – стрела  \r\n> байна – стоит  \r\n> тэрэ – указ. местоим. тот, та, то; он, она, оно  \r\n> бодол – мысль  \r\n> боодол – место завязки  \r\n> ундэгэн – яйцо  \r\n> гар – рука  \r\n> амитан – животное  \r\n> ташуур – кнут  \r\n\r\n####**Упражнение № 4. На краткий _у_ и долгий _уу_**\r\n\r\nзураба – зуураба: Сэсэг зураба. Хүйтэндэ зуураба.  \r\nбуда – бууда: Буда хүбүүн. Шубуу бууда.  \r\nуг – ууг: Хүнэй уг гарбал. Бата уһа ууг.  \r\nураг – уураг: Ураг ерэбэ. Уураг тархи.  \r\nтуха – тууха: Тухамни болоногүй. Малаа тууха.  \r\n\r\n> **Слова:**   \r\n> зураха – рисовать  \r\n> хүйтэн – холод  \r\n> Буда – хүнэй нэрэ (имя человека)  \r\n> шубуун – птица  \r\n> уг – корень, начало  \r\n> хүн – человек  \r\n> ууха – пить   \r\n> ерэхэ – приходить  \r\n> туха – досуг, свободное время  \r\n> мал – скот  \r\n> тухамни болоногүй – руки не доходят, нет свободного времени  \r\n> сэсэг – цветок  \r\n> зуураха – замерзать   \r\n> буудаха – стрелять  \r\n> хүбүүн – мальчик  \r\n> уг гарбал – происхождение   \r\n> уһан – вода  \r\n> ураг – родственник  \r\n> уураг тархи – мозг  \r\n> тууха – гнать  \r\n\r\n####**Упражнение № 5. На краткий _э_ и долгий _ээ_**\r\n\r\nбээлэй – бэлэй: Нооһон бээлэй. Ябаа бэлэй.  \r\nтэхэ –тээхэ: Мүргэдэг тэхэ. Ашаа тээхэ.   \r\nбэшэ – бэшээ: Бэшэ нүхэдшни хаанаб? Бэшэг бэшээ.  \r\nэшэ – эшээ (н): Эшэгүй һүхэ. Эшээ түхеэрхэ.  \r\n\r\n> **Слова:**  \r\n> бээлэй – рукавицы  \r\n> ябаха – идти  \r\n> тэхэ – козел  \r\n> мүргэдэг – бодающийся  \r\n> бэшэхэ – писать  \r\n> хаана – где  \r\n> эшэ – ручка инструмента (топора)  \r\n> эшээ(н) – нора, берлога  \r\n> нооһон – шерсть  \r\n> бэлэй – связка выражает прошедшее время  \r\n> бэшэг – письмо  \r\n> бэшэ – другой, остальной  \r\n> нухэр – друг  \r\n> һүхэ – топор  \r\n> түхеэрхэ – устраивать, готовиться  \r\n\r\n####**Упражнение № 6. На краткий _ү_ и долгий _үү_**\r\n\r\nзүбшэ – зүүбшэ: Эжытэеэ зүбшэ. Гоё зүүбшэ.  \r\nхүргэ – хүүргэ: Гэртэм хүргэ. Хүүргэ бариха.  \r\nүргэ – үүргэ: Түмэр үргэ. Үүргэ дүүргэхэ.  \r\nдүрэ – дүүрэ: Дүрэ хараха. Аашалхаяа дүүрэ.  \r\nдүрэхэ – дүүрэхэ: Наранда дүрэхэ. Уһаар дүүрэхэ.  \r\n\r\n> **Слова:**  \r\n> зүүбшэ – подвески  \r\n> зүбшэхэ – советоваться   \r\n> хүргэхэ – провожать  \r\n> хүүргэ – мост  \r\n> дүрэ – вид, облик  \r\n> түмэр – железо  \r\n> дүүрэхэ – заканчиваться  \r\n> бариха – строить  \r\n> үүргэ – обязанность  \r\n> наран – солнце  \r\n> гоё – красивый  \r\n> эжы – мать  \r\n> гэр – дом  \r\n> дүүргэхэ – выполнять  \r\n> хараха – смотреть, видеть  \r\n> аашалха – баловаться  \r\n> дүрэхэ – гореть  \r\n> үргэхэ – поднимать  \r\n> дүүрэхэ – наполняться  \r\n> уһан – вода  \r\n\r\n**Задание:** Повторить дома пройденный грамматический материал.\r\n\r\n###Дүрбэдэхи хэшээл. Четвертый урок\r\n\r\n> Дифтонги\r\n\r\n####**Упражнение № 1. Дифтонг _ай_**\r\n\r\nМанай колхоз олон гахайтай. Үбэл гахайнууд дулаан байрада байдаг. Гахайшан гахай һайнаар тэжээнэ. Айл зайха албатай, архи ууха ажалтай (посл). Дайда байбалнь зайдаг, далай байбалнъ губшадаг (посл). Зайран хүнэй зам ута, айран хүнэй алхам ута (посл).\r\n\r\n> **Слова:**  \r\n> манай – наш  \r\n> гахай –свинья  \r\n> дулаан – теплый  \r\n> гахайшан – свинарь  \r\n> айл – семья, дом  \r\n> албатай – несущий службу  \r\n> ууха – пить  \r\n> дайда – земля, местность, бескрайняя степь  \r\n> зайран – бродяга, гуляка  \r\n> губшаха – ловить неводом  \r\n> ута – длинный  \r\n> олон – много  \r\n> үбэл – зима  \r\n> байра – помещение (свинарник)  \r\n> тэжээхэ – кормить, вскармливать  \r\n> зайха – бродить  \r\n> архи – водка (спиртное)  \r\n> ажалтай – имеющий работу, занятый  \r\n> айран – трус, пугливый  \r\n> далай – океан  \r\n> зам – путь, дорога  \r\n> алхам – шаг  \r\n\r\n####**Упражнение № 2. Дифтонг _ой_**\r\n\r\nТолгойнь үһэн үдхэн, толгойнь дотороо хооһон (посл). Толгойшни ноёной, тохоногшни минаагай (посл). Ойншни олигтой болобо, сээжэшни һанаатай болобо (посл). Һохорой газар – һохороороо, дохолоной газар – дохолоноороо (посл). Нохойһоо түрэһэн нохойдоо баригдаха, нобшоһоо түрэһэн нозогтоо баригдаха (посл).\r\n\r\n> **Слова:**  \r\n> толгой – голова   \r\n> хооһон – пустой  \r\n> тохоног – локоть  \r\n> ой – юбилей  \r\n> сээжэ – грудь  \r\n> дохолон – хромой  \r\n> түрэһэн – родной  \r\n> һанаатай – имеющий какую-то мысль  \r\n> нозог – головотяпь, леность, копуша  \r\n> дотороо – внутри  \r\n> удхэн – густой  \r\n> ноён – чиновник  \r\n> минаа – плеть, кнут  \r\n> олигтой – путный, толковый  \r\n> һохор – слепой  \r\n> нохой – собака  \r\n> нобшо – сор, хлам  \r\n\r\n####**Упражнение № 3. Дифтонг _уй_**\r\n\r\nУйтан гутал хүл хабшадаг, уймар хүн хүниие хашадаг. Һаалишад ехэ амжалта туйлаба. Аюша агнуурида ошолдохые гуйна.\r\n\r\n> **Слова:**  \r\n> уйтан – узкий  \r\n> хабшаха – давить, сжимать   \r\n> хашадаг – притесняет  \r\n> хун – человек  \r\n> амжалта – успех (достижение)  \r\n> агнуури – промысел, охота  \r\n> гутал – обувь  \r\n> уймар – глупый (сумасбродный)  \r\n> хул – нога  \r\n> һаалишад – доярки  \r\n> туйлаха – достигать  \r\n> гуйха – просить  \r\n\r\n####**Упражнение № 4. Дифтонг _эй_**\r\n\r\nХүн бүхэн түрэһэн эхэтэй, турэлхи хэлэтэй. Үнеэнэй аша туһа ехэ. Үнеэн – сагаан эдеэнэй эхэ юм. Гэрэй хүндыдэ улгөөтэй байһан эбэр. Үбэлэй хүйтэн үнгэрбэ. Миисгэй модон дээрэ һууна. Үхибүүдтэ эхэ эсэгэ хэрэгтэй, үтэлһэн зондо ургэмжэ хэрэгтэй.\r\n\r\n> **Слова:**  \r\n> эхэ – мать  \r\n> хэлэн – язык, речь  \r\n> эдеэн – пища  \r\n> аша тупа – польза  \r\n> хүнды – пустота, пустое пространство, пустой  \r\n> хуйтэн – холодный  \r\n> миисгэй – кошка, котенок  \r\n> дээрэ – на  \r\n> эхэ эсэгэ – мать с отцом, родители  \r\n> үлгэхэ – вешать, подвешивать  \r\n> үргэмжэ – содержание (на иждивении), поддержка  \r\n> бүхэн – каждый  \r\n> үнеэн – корова  \r\n> сагаан – белый  \r\n> гэр – дом  \r\n> эбэр – рога  \r\n> үбэл – зима  \r\n> үнгэрхэ – проходить  \r\n> модон – дерево  \r\n> һууха – сидеть  \r\n> үтэлһэн – престарелый  \r\n> хэрэгтэй – нужный  \r\n\r\n####**Упражнение № 5. Дифтонг _уй_**\r\n\r\nТоогүй торобо, гайгүй гартаба (посл). Урагшагүй хүндэ ухаагүй ноён. Энэ зүйлнүүдынь таһаршагүй холбоотой. Зоболон үзөөгүй хүн жаргал гээшые мэдэхэгүй (посл). Адхарһан аяга дүүрэдэггүй. Дайдын ногоон тоолошогүй, далайн оёор хэмнэшэгүй.\r\n\r\n> **Слова:**  \r\n> тоо – число  \r\n> гай – беда, горе  \r\n> урагшагүй – неудачный (безуспешный)  \r\n> ухаагүй – бестолковый (глупый)   \r\n> таһаршагүй – неразрывно  \r\n> тоолошогүй – неисчислимый  \r\n> торохо – спотыкаться  \r\n> гартаха – быть проходимым  \r\n> жаргал – счастье  \r\n> мэдэхэгүй – не знает  \r\n> зоболон – мучение, мука  \r\n> хэмнэшэгуй – неизмеримый  \r\n\r\n> **Грамматика:**\r\n> В конце слов принято писать долгий **_ы_**.  \r\n> шугы, дугы, ургы, бүхы, харгы, гунзэгы, юрэнхы, хэрзэгы, эжы.\r\n\r\n**Задание:** Найти в тексте слова с дифтонгами, выписать их, составить с ними предложения. Прочитать и пересказать текст.\r\n\r\nШандаган\r\n\r\nҮбэлэй сагта шандаган саб сагаан үнгэтэй. Саһанай ороходо, шандаган ехээр баярладаг. Шугы соо бургааһанай үбэртэ саһа хонхойлоод хэбтэхэдэнь, тэрэниие обёорхогүйш. Хүншье, аншье харангүй хажуугаарнь гараха байгаа. Теэд шандаган ехэ айран амитан юм. Тэрээндэ дүтэ юумэнэй һаршаганахада, бодоод гүйшэдэг, холо харайдаг хурдан амитан юм.\r\n\r\n> **Слова:**  \r\n> шандаган – заяц  \r\n> саг – время  \r\n> бургааһан – кустарник  \r\n> обёорхогуй – не заметить  \r\n> үнгэ – цвет  \r\n> орохо – идти  \r\n> шугы – роща  \r\n> хүн – человек  \r\n> харангүй – не увидев  \r\n> амитан – животное  \r\n> убэл – зима  \r\n> сагаан – белый  \r\n> убэр – передняя или солнечная сторона  \r\n> саһан – снег  \r\n> баярлаха – радоваться  \r\n> һаршаганаха – шелестеть, шуршат  \r\n> ан – зверь  \r\n> айран – трусливый  \r\n> хурдан – быстрый  \r\n\r\n**Задание:** Повторить дома пройденный грамматический материал.',1,1,1,1466239971,1467306268),
	(3,'Уроки 5 - 8','uroki-5-8','',1,1,1,1467606400,1467608042);

/*!40000 ALTER TABLE `book_chapter` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы buryat_name
# ------------------------------------------------------------

DROP TABLE IF EXISTS `buryat_name`;

CREATE TABLE `buryat_name` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `note` text DEFAULT NULL,
  `male` tinyint(1) NOT NULL,
  `female` tinyint(1) NOT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL DEFAULT 1476201209,
  `updated_at` int(11) NOT NULL DEFAULT 1476201209,
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx-buryat_name-name` (`name`),
  KEY `fk-buryat_name-created_by-user-id` (`created_by`),
  KEY `fk-buryat_name-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-buryat_name-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-buryat_name-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `buryat_name` WRITE;
/*!40000 ALTER TABLE `buryat_name` DISABLE KEYS */;

INSERT INTO `buryat_name` (`id`, `name`, `description`, `note`, `male`, `female`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'Абармид','запредельный','Бурятская форма от санскритского слова \"парамита.\" Это слово означает \"ушедший по ту сторону\", т.е. в нирвану. В буддийских сутрах перечисляют 6 или 10 парамит, с помощью которых осуществляется уход в нирвану, такие как щедрость, нравственность, терпеливость, мужественность, созерцание, мудрость. Каждая парамита используется в качестве имен.',1,0,1,1,1476201209,1476201209);

/*!40000 ALTER TABLE `buryat_name` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы buryat_translation
# ------------------------------------------------------------

DROP TABLE IF EXISTS `buryat_translation`;

CREATE TABLE `buryat_translation` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `burword_id` int(10) unsigned NOT NULL,
  `dict_id` int(11) DEFAULT NULL,
  `name` varchar(2000) NOT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL DEFAULT 1476201215,
  `updated_at` int(11) NOT NULL DEFAULT 1476201215,
  PRIMARY KEY (`id`),
  KEY `fk-rutranslations-burword_id-burwords-id` (`burword_id`),
  KEY `fk-buryat_translation-created_by-user-id` (`created_by`),
  KEY `fk-buryat_translation-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-buryat_translation-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-buryat_translation-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-rutranslations-burword_id-burwords-id` FOREIGN KEY (`burword_id`) REFERENCES `buryat_word` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

LOCK TABLES `buryat_translation` WRITE;
/*!40000 ALTER TABLE `buryat_translation` DISABLE KEYS */;

INSERT INTO `buryat_translation` (`id`, `burword_id`, `dict_id`, `name`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,1,1,'делать неуверенные вялые движения',1,1,1476201215,1476201215);

/*!40000 ALTER TABLE `buryat_translation` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы buryat_word
# ------------------------------------------------------------

DROP TABLE IF EXISTS `buryat_word`;

CREATE TABLE `buryat_word` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `dict_id` int(11) DEFAULT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL DEFAULT 1476201210,
  `updated_at` int(11) NOT NULL DEFAULT 1476201210,
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx-buryat_word-name` (`name`),
  KEY `fk-buryat_word-created_by-user-id` (`created_by`),
  KEY `fk-buryat_word-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-buryat_word-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-buryat_word-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

LOCK TABLES `buryat_word` WRITE;
/*!40000 ALTER TABLE `buryat_word` DISABLE KEYS */;

INSERT INTO `buryat_word` (`id`, `name`, `dict_id`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'аабаганаха',1,1,1,1476201210,1476201210);

/*!40000 ALTER TABLE `buryat_word` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы buryat_word_temp
# ------------------------------------------------------------

DROP TABLE IF EXISTS `buryat_word_temp`;

CREATE TABLE `buryat_word_temp` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `remainder` varchar(4096) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;



# Дамп таблицы dictionary
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dictionary`;

CREATE TABLE `dictionary` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(80) NOT NULL,
  `info` varchar(255) NOT NULL,
  `isbn` varchar(30) DEFAULT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL DEFAULT 1476201219,
  `updated_at` int(11) NOT NULL DEFAULT 1476201219,
  PRIMARY KEY (`id`),
  KEY `fk-dictionary-created_by-user-id` (`created_by`),
  KEY `fk-dictionary-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-dictionary-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-dictionary-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

LOCK TABLES `dictionary` WRITE;
/*!40000 ALTER TABLE `dictionary` DISABLE KEYS */;

INSERT INTO `dictionary` (`id`, `name`, `info`, `isbn`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'Бурятско-русский и русско-бурятский словарь С.М. Бабушкина, 16-е издание','Бабушкин С.М. Бурятско-русский и русско-бурятский словарь. В 2-х частях. Улан-Удэ: Издательство ОАО \"Республиканская типография\", 2013-616с.','978-5-91407-089-9',1,1,1476201219,1476201219);

/*!40000 ALTER TABLE `dictionary` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы migration
# ------------------------------------------------------------

DROP TABLE IF EXISTS `migration`;

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`version`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `migration` WRITE;
/*!40000 ALTER TABLE `migration` DISABLE KEYS */;

INSERT INTO `migration` (`version`, `apply_time`)
VALUES
	('m000000_000000_base',1459845105),
	('m140209_132017_init',1459845108),
	('m140403_174025_create_account_table',1459845109),
	('m140504_113157_update_tables',1459845109),
	('m140504_130429_create_token_table',1459845109),
	('m140506_102106_rbac_init',1467905879),
	('m140830_171933_fix_ip_field',1459845109),
	('m140830_172703_change_account_table_name',1459845109),
	('m141222_110026_update_ip_field',1459845110),
	('m141222_135246_alter_username_length',1459845110),
	('m150614_103145_update_social_account_table',1459845110),
	('m150623_212711_fix_username_notnull',1459845110),
	('m151218_234654_add_timezone_to_profile',1472464302),
	('m160329_030431_create_news_table',1459845116),
	('m160401_023234_add_column_description_for_news_table',1459845116),
	('m160416_012729_create_fk_for_burwords_and_ruwords',1460774364),
	('m160426_070758_drop_columns_burword_table',1461739681),
	('m160427_040432_delete_column_desc_rutranslation_table',1461739681),
	('m160427_052921_alter_column_name_rutranslations_table',1461739682),
	('m160427_054739_alter_column_name_burtranslations_table',1461739683),
	('m160427_063743_delete_incorrect_data',1461739684),
	('m160430_074640_alter_column_name_buryat_name_table',1462002789),
	('m160506_080205_change_name_dictionaries_table',1462757681),
	('m160506_082623_rename_tables_burwords_temp_partsofspeech',1462757681),
	('m160506_084256_rename_burwords_table',1462757681),
	('m160507_124345_rename_ruwords_table',1462757681),
	('m160508_062836_rename_tables_rutranslations_burtranslations',1462757681),
	('m160517_052118_create_page_table',1463617074),
	('m160517_053135_add_column_link_page_table',1463617074),
	('m160518_075441_alter_column_page_table',1463617075),
	('m160521_055234_add_colunm_active_page_table',1463932057),
	('m160604_165736_add_index_buryat_word_table',1465060468),
	('m160604_170754_add_index_russian_word_table',1465060468),
	('m160604_170915_add_index_buryat_name_table',1465060468),
	('m160614_050157_add_column_active_news_table',1466014106),
	('m160615_184140_create_book_table',1466104337),
	('m160615_195721_create_book_chapter_table',1466104337),
	('m160616_082824_add_column_content_book_table',1466104338),
	('m160621_185827_add_column_menu_name_page_table',1466536892),
	('m160624_150535_add_column_slug_news_table',1467306102),
	('m160625_052955_add_column_slug_book_table',1467306102),
	('m160630_164523_add_column_slug_book_chapter',1467306102),
	('m160809_122303_rbac_init',1470793926),
	('m160816_035529_add_static_pages',1471320625),
	('m160821_101110_rename_service_link_page_table',1471774997),
	('m160827_112409_add_column_static_page_table',1472298870),
	('m160902_142630_add_unique_name_buryat_name_table',1472828048),
	('m160903_021332_add_index_unique_russian_word_table',1472873672),
	('m160903_033307_fixed_index_buryat_name_table',1472874003),
	('m160903_033853_add_index_unique_buryat_word_table',1472874386),
	('m160915_030113_add_index_unique_news_table',1476201208),
	('m160915_030814_add_index_unique_book_table',1476201208),
	('m160929_103127_add_last_login_at_to_user_table',1495597526),
	('m161008_110054_add_column_buryat_name_table',1476201209),
	('m161009_035831_add_columns_buryat_word_table',1476201212),
	('m161009_040813_add_columns_russian_word_table',1476201214),
	('m161009_121454_add_columns_buryat_translation_table',1476201217),
	('m161009_130704_add_columns_russian_translation_table',1476201219),
	('m161010_005731_add_columns_dictionary_table',1476201219),
	('m161010_012048_add_column_news_table',1476201219),
	('m161010_013540_add_columns_page_table',1476201220),
	('m161010_014929_add_columns_book_table',1476201220),
	('m161010_015741_add_columns_book_chapter_table',1476201220),
	('m161013_153111_create_search_data_table',1476802342),
	('m211116_090447_add_column_dict_id_in_buryat_word_table',1637083945),
	('m211116_173701_add_default_dictionary_for_buryat_words',1637084504),
	('m211116_175109_add_column_dict_id_in_russia_word_table',1637085374),
	('m211116_175527_add_default_dictionary_for_russian_words',1637085375),
	('m211116_175956_add_column_dict_id_in_russian_translation_table',1637085927),
	('m211116_180113_add_default_dictionary_for_russian_words',1637085929),
	('m211116_181658_create_index_for_search_data_table',1637086767);

/*!40000 ALTER TABLE `migration` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы news
# ------------------------------------------------------------

DROP TABLE IF EXISTS `news`;

CREATE TABLE `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `content` text NOT NULL,
  `active` tinyint(1) NOT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `slug` (`slug`),
  UNIQUE KEY `idx-news-title` (`title`),
  KEY `fk-news-created_by-user-id` (`created_by`),
  KEY `fk-news-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-news-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-news-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `news` WRITE;
/*!40000 ALTER TABLE `news` DISABLE KEYS */;

INSERT INTO `news` (`id`, `title`, `slug`, `description`, `content`, `active`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'Тестовая новость.','testovaya-notost','Описание тестовой новости.','**Описание**\r\n\r\nLorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.',1,1,1,1461229896,1474257460);

/*!40000 ALTER TABLE `news` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы page
# ------------------------------------------------------------

DROP TABLE IF EXISTS `page`;

CREATE TABLE `page` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `menu_name` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `link` varchar(100) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `content` text NOT NULL,
  `active` tinyint(1) NOT NULL,
  `static` tinyint(1) NOT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `link` (`link`),
  KEY `fk-page-created_by-user-id` (`created_by`),
  KEY `fk-page-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-page-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-page-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `page` WRITE;
/*!40000 ALTER TABLE `page` DISABLE KEYS */;

INSERT INTO `page` (`id`, `menu_name`, `title`, `link`, `description`, `content`, `active`, `static`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(1,'О нас','О нас','about','Страница о нас','Проект был создан в 2013 году\r\n\r\n',0,1,1,1,1471320625,1471775029),
	(2,'Услуги','Услуги перевода','services','Страница услуг','Тут возможно будет информация по услугам',0,1,1,1,1471320625,1471320625);

/*!40000 ALTER TABLE `page` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы part_speech
# ------------------------------------------------------------

DROP TABLE IF EXISTS `part_speech`;

CREATE TABLE `part_speech` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL,
  `full_name` varchar(100) DEFAULT NULL,
  `color` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

# Дамп таблицы profile
# ------------------------------------------------------------

DROP TABLE IF EXISTS `profile`;

CREATE TABLE `profile` (
  `user_id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `public_email` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `gravatar_email` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `gravatar_id` varchar(32) COLLATE utf8_unicode_ci DEFAULT NULL,
  `location` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `website` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `bio` text COLLATE utf8_unicode_ci DEFAULT NULL,
  `timezone` varchar(40) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`user_id`),
  CONSTRAINT `fk_user_profile` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `profile` WRITE;
/*!40000 ALTER TABLE `profile` DISABLE KEYS */;

INSERT INTO `profile` (`user_id`, `name`, `public_email`, `gravatar_email`, `gravatar_id`, `location`, `website`, `bio`, `timezone`)
VALUES
	(1,'Администратор','','','','','','','Asia/Irkutsk');

/*!40000 ALTER TABLE `profile` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы russian_translation
# ------------------------------------------------------------

DROP TABLE IF EXISTS `russian_translation`;

CREATE TABLE `russian_translation` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ruword_id` int(10) unsigned NOT NULL,
  `name` varchar(100) NOT NULL,
  `dict_id` int(11) DEFAULT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL DEFAULT 1476201217,
  `updated_at` int(11) NOT NULL DEFAULT 1476201217,
  PRIMARY KEY (`id`),
  KEY `fk-burtranslations-ruword_id-ruwords-id` (`ruword_id`),
  KEY `fk-russian_translation-created_by-user-id` (`created_by`),
  KEY `fk-russian_translation-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-burtranslations-ruword_id-ruwords-id` FOREIGN KEY (`ruword_id`) REFERENCES `russian_word` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-russian_translation-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-russian_translation-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

LOCK TABLES `russian_translation` WRITE;
/*!40000 ALTER TABLE `russian_translation` DISABLE KEYS */;

INSERT INTO `russian_translation` (`id`, `ruword_id`, `name`, `dict_id`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(2,3,'тобшолһон нэрэ',1,1,1,1476201217,1476201217);

/*!40000 ALTER TABLE `russian_translation` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы russian_word
# ------------------------------------------------------------

DROP TABLE IF EXISTS `russian_word`;

CREATE TABLE `russian_word` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `dict_id` int(11) DEFAULT NULL,
  `created_by` int(11) NOT NULL DEFAULT 1,
  `updated_by` int(11) NOT NULL DEFAULT 1,
  `created_at` int(11) NOT NULL DEFAULT 1476201212,
  `updated_at` int(11) NOT NULL DEFAULT 1476201212,
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx-russian_word-name` (`name`),
  KEY `fk-russian_word-created_by-user-id` (`created_by`),
  KEY `fk-russian_word-updated_by-user-id` (`updated_by`),
  CONSTRAINT `fk-russian_word-created_by-user-id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk-russian_word-updated_by-user-id` FOREIGN KEY (`updated_by`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

LOCK TABLES `russian_word` WRITE;
/*!40000 ALTER TABLE `russian_word` DISABLE KEYS */;

INSERT INTO `russian_word` (`id`, `name`, `dict_id`, `created_by`, `updated_by`, `created_at`, `updated_at`)
VALUES
	(3,'аббревиатура',1,1,1,1476201212,1476201212);

/*!40000 ALTER TABLE `russian_word` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы search_data
# ------------------------------------------------------------

DROP TABLE IF EXISTS `search_data`;

CREATE TABLE `search_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `type` tinyint(1) NOT NULL,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `idx-search_data-name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



# Дамп таблицы social_account
# ------------------------------------------------------------

DROP TABLE IF EXISTS `social_account`;

CREATE TABLE `social_account` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) DEFAULT NULL,
  `provider` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `client_id` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `data` text COLLATE utf8_unicode_ci DEFAULT NULL,
  `code` varchar(32) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `account_unique` (`provider`,`client_id`),
  UNIQUE KEY `account_unique_code` (`code`),
  KEY `fk_user_account` (`user_id`),
  CONSTRAINT `fk_user_account` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;



# Дамп таблицы token
# ------------------------------------------------------------

DROP TABLE IF EXISTS `token`;

CREATE TABLE `token` (
  `user_id` int(11) NOT NULL,
  `code` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` int(11) NOT NULL,
  `type` smallint(6) NOT NULL,
  UNIQUE KEY `token_unique` (`user_id`,`code`,`type`),
  CONSTRAINT `fk_user_token` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `token` WRITE;
/*!40000 ALTER TABLE `token` DISABLE KEYS */;

INSERT INTO `token` (`user_id`, `code`, `created_at`, `type`)
VALUES
	(1,'EuDqURq1fJdyLCwyoRLlwWd8hq6MX34V',1461741521,1);

/*!40000 ALTER TABLE `token` ENABLE KEYS */;
UNLOCK TABLES;


# Дамп таблицы user
# ------------------------------------------------------------

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password_hash` varchar(60) COLLATE utf8_unicode_ci NOT NULL,
  `auth_key` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `confirmed_at` int(11) DEFAULT NULL,
  `unconfirmed_email` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `blocked_at` int(11) DEFAULT NULL,
  `registration_ip` varchar(45) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  `flags` int(11) NOT NULL DEFAULT 0,
  `last_login_at` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_unique_email` (`email`),
  UNIQUE KEY `user_unique_username` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;

INSERT INTO `user` (`id`, `username`, `email`, `password_hash`, `auth_key`, `confirmed_at`, `unconfirmed_email`, `blocked_at`, `registration_ip`, `created_at`, `updated_at`, `flags`, `last_login_at`)
VALUES
	(1,'admin','admin@exmaple.com','$2y$13$eR5BT./2ZgGN9XBlhaVe8uf9V3DRcCzK0QPK4sRk3R1Niqwyo01e6','ETtnj8brlJDpwRZRIinnyryO2C7WZXza',1459845148,NULL,NULL,NULL,1459845148,1637793121,0,1637793070);

/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
